Revit 2015 API
EnergyAnalysisSurface Properties
The EnergyAnalysisSurface type exposes the following members.
Properties
Name | Description
Azimuth
 The azimuth angle for this surface.
CADLinkUniqueId
 The unique id of the originating CAD object's link (linked document) associated with this surface.
CADObjectUniqueId
 The unique id of the originating CAD object (model element) associated with this surface.
Corner
 The lower-left coordinate for the analytical rectangular geometry viewed from outside.
Height
 The height of the analytical rectangular geometry.
Id
 The unique identifier for the surface.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The unique name identifier for this surface.
Normal
 The outward normal for this surface.
OriginatingElementDescription
 The description for the originating Revit element.
OriginatingElementId |  Obsolete.
 The element id for the originating Revit element.
SurfaceType
 The analytical surface type.
Tilt
 The tilt angle for this surface.
Type
 The gbXML surface type attribute.
Width
 The width of the analytical rectangular geometry.
See Also
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace